In [1]:
!pip install PyMysql

Collecting PyMysql
  Downloading PyMySQL-0.10.1-py2.py3-none-any.whl (47 kB)
Installing collected packages: PyMysql
Successfully installed PyMysql-0.10.1

In [2]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\tejas chavan\anaconda3\lib\site-packages (1.3.13)

In [4]:
#import pandas library
import pandas as pd
import sqlalchemy

In [39]:
#create connect engine

engine = sqlalchemy.create_engine('mysql+pymysql://root:tejas2188@localhost:3306/databasepython')

In [40]:
#read table fro sql

In [41]:
df = pd.read_sql_table("customers",engine)

In [42]:
df

   customerid customername education  age
0           1        rahul  Graduate   41
1           2        akash        BE   53
2           3       lokesh  Graduate   23
3           4         Amit        ma   27
4           5      saurabh       mba   32
5           6      somnath        ms   29

In [43]:
#read specific columns from sql table

fd = pd.read_sql_table("customers",engine, columns =["customerid","customername"])

In [44]:
fd

   customerid customername
0           1        rahul
1           2        akash
2           3       lokesh
3           4         Amit
4           5      saurabh
5           6      somnath

In [46]:
#read sql table using query

query = "SELECT * FROM databasepython.customers"

df = pd.read_sql_query(query,engine)

In [47]:
df

   customerid customername education  age
0           1        rahul  Graduate   41
1           2        akash        BE   53
2           3       lokesh  Graduate   23
3           4         Amit        ma   27
4           5      saurabh       mba   32
5           6      somnath        ms   29

In [48]:
#read excel file from local

data = pd.read_excel(r"C:\Users\Tejas Chavan\Desktop\byteiq\python_sql.xlsx")

In [49]:
data

  customername Education  AGES
0         Amit        ma    27
1      saurabh       mba    32
2      somnath        ms    29

In [50]:
#rename columns 

data.rename(columns = {'Education':'education','AGES':'age'},inplace =True)

In [51]:
data

  customername education  age
0         Amit        ma   27
1      saurabh       mba   32
2      somnath        ms   29

In [52]:
#append excel data to sql table

data.to_sql(name ="customers", con =engine, index = False, if_exists = "append")

In [53]:
#read appended data from sql

pd.read_sql("customers",engine)

   customerid customername education  age
0           1        rahul  Graduate   41
1           2        akash        BE   53
2           3       lokesh  Graduate   23
3           4         Amit        ma   27
4           5      saurabh       mba   32
5           6      somnath        ms   29
6           7         Amit        ma   27
7           8      saurabh       mba   32
8           9      somnath        ms   29